In [1]:
#Import dependencies
import pandas as pd

#Import files from resources folder in my new repository 
school_data_csv = "Resources/schools_complete.csv"
student_data_csv = "Resources/students_complete.csv"

#Read school and student csvs and store into dataframe
school_data = pd.read_csv(school_data_csv)
student_data = pd.read_csv(student_data_csv)

#Merge the datasets using a left join to make one single dataset 
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name","school_name"])

In [2]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [3]:
unique_schools = school_data_complete["school_name"].nunique()
unique_schools

15

In [4]:
students_count = school_data_complete["student_name"].count()
students_count

39170

In [5]:
average_math_score = school_data_complete["math_score"].mean()
average_math_score

average_reading_score = school_data_complete["reading_score"].mean()
average_reading_score

81.87784018381414

In [6]:
unique_schools_name = school_data_complete["school_name"].unique()
unique_schools_name

array(['Huang High School', 'Figueroa High School', 'Shelton High School',
       'Hernandez High School', 'Griffin High School',
       'Wilson High School', 'Cabrera High School', 'Bailey High School',
       'Holden High School', 'Pena High School', 'Wright High School',
       'Rodriguez High School', 'Johnson High School', 'Ford High School',
       'Thomas High School'], dtype=object)

In [7]:
school_data_complete.loc[:, ["school_name", "budget"]].head()

         school_name   budget
0  Huang High School  1910635
1  Huang High School  1910635
2  Huang High School  1910635
3  Huang High School  1910635
4  Huang High School  1910635

In [8]:
inv_budget = school_data_complete['budget'].unique()
inv_budget

array([1910635, 1884411, 1056600, 3022020,  917500, 1319574, 1081356,
       3124928,  248087,  585858, 1049400, 2547363, 3094650, 1763916,
       1043130])

In [9]:
total_budget = inv_budget.sum()
total_budget

24649428

In [10]:
passing_math = school_data_complete.loc[school_data_complete["math_score"] >= 70, ["student_name"]]
passing_math.count()

student_name    29370
dtype: int64

In [11]:
passing_reading = school_data_complete.loc[school_data_complete["reading_score"] >= 70, ["student_name"]]
passing_reading.count()

student_name    33610
dtype: int64

In [12]:
passing_both = school_data_complete.loc[(school_data_complete["reading_score"] >= 70) &
                                        (school_data_complete["math_score"] >= 70), ["student_name"]]
passing_both.count()

student_name    25528
dtype: int64

In [13]:
#Set count of variables as seperate variable to do calculations 
pass_reading = passing_reading.count()
pass_math = passing_math.count()
pass_both = passing_both.count()

In [14]:
#passing_reading = passing_reading.astype(float)
#students_count = students_count.astype(float)

pass_reading_percent = ((pass_reading)/(students_count)*100)
pass_reading_percent

pass_math_percent = ((pass_math)/(students_count)*100)
pass_math_percent

pass_both_percent = ((pass_both)/(students_count)*100)
pass_both_percent

student_name    65.172326
dtype: float64

In [15]:
district_df = pd.DataFrame({"Total schools":[unique_schools],
                           "Total students": [students_count],
                           "Average math score":[average_math_score],
                           "Average reading score":[average_reading_score],
                           "Total budget":[total_budget],
                           "% Pass Math": [pass_math_percent],
                           "% Pass Reading": [pass_reading_percent],
                           "% Pass Both":[pass_both_percent]})

district_df["% Pass Math"]=district_df["% Pass Math"].astype(float)
district_df["% Pass Math"]=district_df["% Pass Math"].map("{:,.2f}%".format)

district_df["% Pass Reading"]=district_df["% Pass Reading"].astype(float)
district_df["% Pass Reading"]=district_df["% Pass Reading"].map("{:,.2f}%".format)

district_df["% Pass Both"]=district_df["% Pass Both"].astype(float)
district_df["% Pass Both"]=district_df["% Pass Both"].map("{:,.2f}%".format)

district_df["Total bugdet"]=district_df["Total budget"].astype(float)
district_df["Total budget"]=district_df["Total budget"].map("${:,.2f}".format)

district_df

,Total schools,Total students,Average math score,Average reading score,Total budget,% Pass Math,% Pass Reading,% Pass Both,Total bugdet
0,15,39170,78.985371,81.87784,"$24,649,428.00",74.98%,85.81%,65.17%,24649428.0

In [16]:
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [27]:
average_reading_schools = school_data_complete.groupby("school_name")['reading_score'].mean()
average_reading_schools

average_math_schools = school_data_complete.groupby("school_name")['math_score'].mean()
average_math_schools

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [45]:
per_pass_r = school_data_complete[school_data_complete['reading_score'] >= 70].groupby('school_name')['student_name']
per_pass_r.count()

school_name
Bailey High School       4077
Cabrera High School      1803
Figueroa High School     2381
Ford High School         2172
Griffin High School      1426
Hernandez High School    3748
Holden High School        411
Huang High School        2372
Johnson High School      3867
Pena High School          923
Rodriguez High School    3208
Shelton High School      1688
Thomas High School       1591
Wilson High School       2204
Wright High School       1739
Name: student_name, dtype: int64

In [39]:
school_size = school_data_complete.groupby("school_name")['size'].count()
school_size

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: size, dtype: int64

In [42]:
school_budget = school_data_complete.groupby("school_name")['budget'].count()
school_budget

school_name
Bailey High School       4976
Cabrera High School      1858
Figueroa High School     2949
Ford High School         2739
Griffin High School      1468
Hernandez High School    4635
Holden High School        427
Huang High School        2917
Johnson High School      4761
Pena High School          962
Rodriguez High School    3999
Shelton High School      1761
Thomas High School       1635
Wilson High School       2283
Wright High School       1800
Name: budget, dtype: int64

In [41]:
per_stu_budget = ((school_size)/(school_budget)*100)
per_stu_budget

school_name            budget
Bailey High School     3124928    100.0
Cabrera High School    1081356    100.0
Figueroa High School   1884411    100.0
Ford High School       1763916    100.0
Griffin High School    917500     100.0
Hernandez High School  3022020    100.0
Holden High School     248087     100.0
Huang High School      1910635    100.0
Johnson High School    3094650    100.0
Pena High School       585858     100.0
Rodriguez High School  2547363    100.0
Shelton High School    1056600    100.0
Thomas High School     1043130    100.0
Wilson High School     1319574    100.0
Wright High School     1049400    100.0
dtype: float64